// Точка спавна новой машинки
const spawnRow = 23;
const spawnCol = 11;

// Критические клетки
const criticalCells = [
    [23, 21],
    [20, 21],
    [17, 21],
    [17, 23],
    [25, 23],
    [25, 21]
];

// Места парковки самолётов
const parkingSpots = [
    [13, 38],
    [15, 38],
    [17, 38],
    [19, 38],
    [21, 38],
    [13, 46],
    [15, 46],
    [17, 46],
    [19, 46],
    [21, 46],
    [23, 46]
];

// Ключевые точки
const coreCells = [
    [23, 11],   // Точка 0 (выезд с площадки)
    [23, 21],   // Точка 1
    [13, 21],   // Точка 2 (терминал)
    [13, 23],   // Точка 3 (вдоль терминала)
    [18, 23],   // Точка 4
    [18, 36],   // Точка 5
    [19, 42],   // Точка 6 (Центр площадки)
    [25, 36],   // Точка 7 (отъезд из площадки)
    [25, 23],   // Точка 8
    [25, 21],   // Точка 9
    [25, 11]    // Точка 10 (уже сама парковка)
]

module.exports = {
    spawnRow, spawnCol,
    parkingSpots,
    coreCells,
    criticalCells
}
